# ABC Insurance Customer Data Analysis and Predictive Modeling

## Background Story

ABC Insurance, once a market leader, has been noticing a worrying trend in its customer base – a gradual but steady increase in customer churn, alongside a static, sometimes faltering, customer lifetime value. The CEO, in a recent town hall, made it clear: "Our customers are the lifeblood of our business. Understanding them isn't just part of the job — it is the job."

Your task comes directly from the top: The CEO, in collaboration with the head of the marketing department, has formally requested a comprehensive analysis to unearth the hidden patterns within the customer data. They believe that the data holds the key to revitalizing ABC Insurance's customer engagement strategy, tailoring product offerings to individual needs, and ultimately turning the tide on churn.

## Data Description

The IT extracted three tables that contains the available information asked by the Head of Marketing: ABC_df_costumer, ABC_df_demographics, ABC_df_termination. 

Please download the data from: https://novasbe365-my.sharepoint.com/:f:/g/personal/nuno_silva_novasbe_pt/Ekl41SdwtkVOiW52LsaEy5QBo1mjQXHZKwKMeNSJRbEu3g?e=tgkSYD

### Dataframes details

#### df_customer:

Contains details about the customers, including their ID, address, policy start dates, and the current annual amounts for car, health, and house insurance.

##### Variables
INDIVIDUAL_ID: Unique identifier for the customer.

ADDRESS_ID: Address identifier for the customer.

CUST_ORIG_DATE: The original date when the customer joined.

DATE_OF_BIRTH: Customer's date of birth.

SOCIAL_SECURITY_NUMBER: Customer's SSN (for identification).

CUST_START_DATE: The start date of the customer's current policy.

CURR_ANN_AMT_CAR: Current annual amount paid for car insurance.

CURR_ANN_AMT_HEALTH: Current annual amount paid for health insurance.

CURR_ANN_AMT_HOUSE: Current annual amount paid for house insurance.

#### df_demographics:
Includes demographic information about the customers, such as income, family status, home ownership, and credit rating.

##### Variables

INDIVIDUAL_ID: Unique identifier for the customer (links to df_customer).

INCOME: Customer's income.

HAS_CHILDREN: Indicates if the customer has children.

LENGTH_OF_RESIDENCE: How long the customer has lived in their current residence.

MARITAL_STATUS: Customer's marital status.

HOME_MARKET_VALUE: Market value of the customer's home.

HOME_OWNER: Indicates if the customer owns their home.

COLLEGE_DEGREE: Indicates if the customer has a college degree.

GOOD_CREDIT: Indicates if the customer has good credit.

ADVANCED_STUDIES: Indicates if the customer has pursued advanced studies.

#### df_termination:

Lists customers who have suspended their policies, including the suspension date.

##### Variables

INDIVIDUAL_ID: Unique identifier for the customer (links to df_customer).

SUSPD_DATE: The date when the customer's policy was suspended.

## Part 1: Data Quality and Customer Understanding 

#### Background: Before delving into sophisticated analyses and model building, ensuring the integrity and quality of data is paramount. The provided datasets are critical for understanding ABC Insurance's clientele but may contain issues affecting their utility for further analysis.

#### 1.1 The exploratory data analysis of the data

In [1]:
#load the required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
from datetime import datetime

#### Load of the datasets and basic statistics

#### 1) CUSTOMERS DATASET

In [2]:
#load the customer dataset
file_path = os.path.join("data","ABC_df_customer.csv")
df_customer = pd.read_csv(file_path)
df_customer.head()

/var/folders/51/kvxxh0pn2p9g4w8qy0z706n40000gn/T/ipykernel_72340/2167222107.py:3: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  df_customer = pd.read_csv(file_path)

,Unnamed: 0,INDIVIDUAL_ID,ADDRESS_ID,CUST_ORIG_DATE,DATE_OF_BIRTH,SOCIAL_SECURITY_NUMBER,CUST_START_DATE,CURR_ANN_AMT_CAR,CURR_ANN_AMT_HEALTH,CURR_ANN_AMT_HOUSE
0,0,2.213000e+11,5.213000e+11,2018-12-09,1978-06-23,608-XX-7640,2018-12-09,1318.877997,517.999317,411
1,1,2.213001e+11,5.213001e+11,2018-01-02,1950-05-30,342-XX-6908,2018-01-02,1474.199182,558.417779,414
2,2,2.213007e+11,5.213002e+11,2009-09-23,1967-07-07,240-XX-9224,2009-09-23,1467.375112,701.649310,442
3,3,2.213016e+11,5.213006e+11,2022-07-25,1969-05-25,775-XX-6249,2022-07-25,1492.409561,401.517490,463
4,4,2.213016e+11,5.213006e+11,2006-10-11,1972-09-25,629-XX-7298,2006-10-11,1284.633494,772.857222,366

In [3]:
df_customer.tail()

,Unnamed: 0,INDIVIDUAL_ID,ADDRESS_ID,CUST_ORIG_DATE,DATE_OF_BIRTH,SOCIAL_SECURITY_NUMBER,CUST_START_DATE,CURR_ANN_AMT_CAR,CURR_ANN_AMT_HEALTH,CURR_ANN_AMT_HOUSE
2303119,2303119,2.213003e+11,5.213001e+11,2014-02-15,1967-07-07,882-XX-4608,NaN,1361.290041,623.368014,426
2303120,2303120,2.213031e+11,5.213013e+11,2022-02-16,1965-05-26,709-XX-1726,NaN,1563.921158,997.482828,507
2303121,2303121,2.213013e+11,5.213005e+11,2019-08-16,1967-07-07,317-XX-1336,NaN,1128.048444,393.819352,300
2303122,2303122,2.213021e+11,5.213008e+11,2005-09-11,1948-10-31,110-XX-9215,NaN,1380.204016,556.785305,424
2303123,2303123,2.213025e+11,5.213009e+11,2008-09-10,1981-04-22,102-XX-6555,NaN,1348.650555,294.226518,408

In [4]:
df_customer.shape

(2303124, 10)

In [5]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2303124 entries, 0 to 2303123
Data columns (total 10 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0              int64
 1   INDIVIDUAL_ID           float64
 2   ADDRESS_ID              float64
 3   CUST_ORIG_DATE          object
 4   DATE_OF_BIRTH           object
 5   SOCIAL_SECURITY_NUMBER  object
 6   CUST_START_DATE         object
 7   CURR_ANN_AMT_CAR        float64
 8   CURR_ANN_AMT_HEALTH     float64
 9   CURR_ANN_AMT_HOUSE      int64
dtypes: float64(4), int64(2), object(4)
memory usage: 175.7+ MB

In [6]:
#get a clearer understanding of the data
df_customer.describe(include='all')

,Unnamed: 0,INDIVIDUAL_ID,ADDRESS_ID,CUST_ORIG_DATE,DATE_OF_BIRTH,SOCIAL_SECURITY_NUMBER,CUST_START_DATE,CURR_ANN_AMT_CAR,CURR_ANN_AMT_HEALTH,CURR_ANN_AMT_HOUSE
count,2.303124e+06,2.303123e+06,2.303123e+06,2303124,2303124,2303124,2211911,2.303124e+06,2.303124e+06,2.303124e+06
unique,NaN,NaN,NaN,5253,3492,1986833,18275,NaN,NaN,NaN
top,NaN,NaN,NaN,2005-09-11,1967-07-07,217-XX-6487,2005-09-11,NaN,NaN,NaN
freq,NaN,NaN,NaN,599153,404695,6,535157,NaN,NaN,NaN
mean,1.151562e+06,2.213018e+11,5.213007e+11,NaN,NaN,NaN,NaN,1.431069e+03,5.725299e+02,4.293221e+02
std,6.648548e+05,9.915268e+05,4.170653e+05,NaN,NaN,NaN,NaN,2.439311e+02,1.896686e+02,7.606463e+01
min,0.000000e+00,2.213000e+11,5.213000e+11,NaN,NaN,NaN,NaN,2.869633e+02,-3.516244e+02,9.000000e+01
25%,5.757808e+05,2.213009e+11,5.213003e+11,NaN,NaN,NaN,NaN,1.264830e+03,4.442061e+02,3.770000e+02
50%,1.151562e+06,2.213018e+11,5.213007e+11,NaN,NaN,NaN,NaN,1.425758e+03,5.720247e+02,4.270000e+02
75%,1.727342e+06,2.213027e+11,5.213010e+11,NaN,NaN,NaN,NaN,1.591793e+03,7.001292e+02,4.790000e+02
max,2.303123e+06,2.213033e+11,5.213015e+11,NaN,NaN,NaN,NaN,2.769374e+03,1.617531e+03,8.870000e+02

#### 1) DEMOGRAPHICS DATASET

In [8]:
#load the transaction dataset
file_path = os.path.join("data","ABC_df_demographic.csv")
df_demographic= pd.read_csv(file_path)
df_demographic.head()

,Unnamed: 0,INDIVIDUAL_ID,INCOME,HAS_CHILDREN,LENGTH_OF_RESIDENCE,MARITAL_STATUS,HOME_MARKET_VALUE,HOME_OWNER,COLLEGE_DEGREE,GOOD_CREDIT,ADVANCED_STUDIES
0,0,2.213028e+11,187500.000,1.0,8.0,Single,300000 - 349999,1,1,1,Y
1,1,2.213032e+11,63750.000,0.0,0.0,Single,NaN,0,0,0,N
2,2,2.213032e+11,41250.000,0.0,15.0,Married,75000 - 99999,1,0,1,N
3,3,2.213032e+11,120558.264,0.0,0.0,NaN,1000 - 24999,1,0,0,N
4,4,2.213032e+11,187500.000,0.0,0.0,NaN,NaN,0,0,1,Y

In [10]:
df_demographic.tail()

,Unnamed: 0,INDIVIDUAL_ID,INCOME,HAS_CHILDREN,LENGTH_OF_RESIDENCE,MARITAL_STATUS,HOME_MARKET_VALUE,HOME_OWNER,COLLEGE_DEGREE,GOOD_CREDIT,ADVANCED_STUDIES
2112574,2112574,2.213006e+11,131250.0,1.0,12.0,Married,50000 - 74999,1,0,1,N
2112575,2112575,2.213006e+11,56250.0,1.0,5.0,Single,50000 - 74999,0,0,1,N
2112576,2112576,2.213006e+11,187500.0,0.0,13.0,Married,225000 - 249999,1,1,1,N
2112577,2112577,2.213006e+11,187500.0,2.0,12.0,Married,100000 - 124999,1,0,1,Y
2112578,2112578,2.213006e+11,63750.0,1.0,4.0,Single,100000 - 124999,1,0,0,N

In [11]:
df_demographic.shape

(2112579, 11)

In [12]:
df_demographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2112579 entries, 0 to 2112578
Data columns (total 11 columns):
 #   Column               Dtype
---  ------               -----
 0   Unnamed: 0           int64
 1   INDIVIDUAL_ID        float64
 2   INCOME               float64
 3   HAS_CHILDREN         float64
 4   LENGTH_OF_RESIDENCE  float64
 5   MARITAL_STATUS       object
 6   HOME_MARKET_VALUE    object
 7   HOME_OWNER           int64
 8   COLLEGE_DEGREE       int64
 9   GOOD_CREDIT          int64
 10  ADVANCED_STUDIES     object
dtypes: float64(4), int64(4), object(3)
memory usage: 177.3+ MB

In [14]:
df_demographic.describe(include='all')

,Unnamed: 0,INDIVIDUAL_ID,INCOME,HAS_CHILDREN,LENGTH_OF_RESIDENCE,MARITAL_STATUS,HOME_MARKET_VALUE,HOME_OWNER,COLLEGE_DEGREE,GOOD_CREDIT,ADVANCED_STUDIES
count,2.112579e+06,2.112579e+06,2.112579e+06,2.112579e+06,2.112579e+06,1680931,1922374,2.112579e+06,2.112579e+06,2.112579e+06,2112579
unique,NaN,NaN,NaN,NaN,NaN,2,19,NaN,NaN,NaN,2
top,NaN,NaN,NaN,NaN,NaN,Married,75000 - 99999,NaN,NaN,NaN,N
freq,NaN,NaN,NaN,NaN,NaN,1048472,365838,NaN,NaN,NaN,1563128
mean,1.056289e+06,2.213018e+11,1.205583e+05,4.684885e-01,6.800571e+00,NaN,NaN,6.983649e-01,3.016152e-01,8.195779e-01,NaN
std,6.098492e+05,9.916207e+05,7.504165e+04,5.853729e-01,5.090825e+00,NaN,NaN,4.589678e-01,4.589592e-01,3.845388e-01,NaN
min,0.000000e+00,2.213000e+11,7.500000e+03,0.000000e+00,0.000000e+00,NaN,NaN,0.000000e+00,0.000000e+00,0.000000e+00,NaN
25%,5.281445e+05,2.213009e+11,7.125000e+04,0.000000e+00,2.000000e+00,NaN,NaN,0.000000e+00,0.000000e+00,1.000000e+00,NaN
50%,1.056289e+06,2.213018e+11,1.205583e+05,0.000000e+00,6.801000e+00,NaN,NaN,1.000000e+00,0.000000e+00,1.000000e+00,NaN
75%,1.584434e+06,2.213027e+11,1.312500e+05,1.000000e+00,1.100000e+01,NaN,NaN,1.000000e+00,1.000000e+00,1.000000e+00,NaN
max,2.112578e+06,2.213033e+11,3.750000e+05,6.000000e+00,1.500000e+01,NaN,NaN,1.000000e+00,1.000000e+00,1.000000e+00,NaN

#### 1) TERMINATION DATASET

In [16]:
#load the transaction dataset
file_path = os.path.join("data","ABC_df_termination.csv")
df_termination= pd.read_csv(file_path)
df_termination.head()

   Unnamed: 0  INDIVIDUAL_ID  SUSPD_DATE
0           0   2.213026e+11  2022-10-09
1           1   2.213028e+11  2022-04-24
2           2   2.213027e+11  2022-05-21
3           3   2.213002e+11  2022-04-27
4           4   2.213026e+11  2022-09-16

In [17]:
df_termination.tail()

        Unnamed: 0  INDIVIDUAL_ID  SUSPD_DATE
269254      269254   2.213022e+11  2022-01-09
269255      269255   2.213007e+11  2022-02-27
269256      269256   2.213030e+11  2022-03-21
269257      269257   2.213025e+11  2022-02-26
269258      269258   2.213024e+11  2022-09-23

In [18]:
df_termination.shape

(269259, 3)

In [19]:
df_termination.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 269259 entries, 0 to 269258
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     269259 non-null  int64
 1   INDIVIDUAL_ID  269259 non-null  float64
 2   SUSPD_DATE     266566 non-null  object
dtypes: float64(1), int64(1), object(1)
memory usage: 6.2+ MB

In [20]:
df_termination.describe(include='all')

           Unnamed: 0  INDIVIDUAL_ID  SUSPD_DATE
count   269259.000000   2.692590e+05      266566
unique            NaN            NaN        2086
top               NaN            NaN  2022-03-17
freq              NaN            NaN         938
mean    134629.000000   2.213018e+11         NaN
std      77728.522403   9.890987e+05         NaN
min          0.000000   2.213000e+11         NaN
25%      67314.500000   2.213009e+11         NaN
50%     134629.000000   2.213018e+11         NaN
75%     201943.500000   2.213027e+11         NaN
max     269258.000000   2.213033e+11         NaN

#### Dataset Preparation for Merging

Before we can merge our datasets for comprehensive analysis and modeling, we need to ensure that the datasets are properly formatted and that any unnecessary columns are removed.

Removing Unnecessary Columns:

In the loading process, an extra column named 'Unnamed: 0' was generated, which is not necessary for our analysis. This could be an artifact from an index column in the CSV file that doesn't provide any meaningful information. We'll proceed to remove this column from all datasets to clean up our data.

Converting ID Columns to Integer Type:

The ID columns, which will be used as keys for merging, must be of a uniform type across all datasets. Currently, these ID columns are not in integer format, which could lead to issues during the merge. We will convert these ID columns (INDIVIDUAL_ID, ADDRESS_ID) to integers for several reasons:
- **Semantic Correctness**: Integer representation aligns with the discrete and non-fractional nature of identifiers, ensuring clarity and data integrity.
- **Enhanced Compatibility**: Integer IDs ensure better interoperability with databases and external applications, reducing integration issues.

In [21]:
#Let's remove the columns that are not required for the analysis
df_customer.drop('Unnamed: 0', axis=1, inplace=True)

df_demographic.drop( 'Unnamed: 0', axis=1, inplace=True)

df_termination.drop('Unnamed: 0', axis=1, inplace=True)

In [22]:
# Check if the INDIVIDUAL_ID and ADDRESS_ID columns have any decimal part by comparing them with their integer conversion
individual_id_decimal_check = (df_customer['INDIVIDUAL_ID'] % 1).sum()
address_id_decimal_check = (df_customer['ADDRESS_ID'] % 1).sum()

individual_id_decimal_check, address_id_decimal_check

(0.0, 0.0)

In [23]:
#Drop the rows with missing values in the columns INDIVIDUAL_ID and ADDRESS_ID
df_customer = df_customer.dropna(subset=['INDIVIDUAL_ID', 'ADDRESS_ID'])

#Convert the INDIVIDUAL_ID and ADDRESS_ID columns to integer
df_customer['INDIVIDUAL_ID'] = df_customer['INDIVIDUAL_ID'].astype(int)
df_customer['ADDRESS_ID'] = df_customer['ADDRESS_ID'].astype(int)

In [24]:

individual_id_decimal_check = (df_demographic['INDIVIDUAL_ID'] % 1).sum()
individual_id_decimal_check

0.0

In [25]:
df_demographic = df_demographic.dropna(subset=['INDIVIDUAL_ID'])

#Convert the INDIVIDUAL_ID column to integer
df_demographic['INDIVIDUAL_ID'] = df_demographic['INDIVIDUAL_ID'].astype(int)

In [26]:
individual_id_decimal_check = (df_termination['INDIVIDUAL_ID'] % 1).sum()
individual_id_decimal_check

0.0

In [27]:
df_termination = df_termination.dropna(subset=['INDIVIDUAL_ID'])
#Convert the INDIVIDUAL_ID column to integer
df_termination['INDIVIDUAL_ID'] = df_termination['INDIVIDUAL_ID'].astype(int)

In [28]:
#merge the customer demographic and termination dataframes on the INDIVIDUAL_ID column
df = pd.merge(df_customer, df_demographic, on='INDIVIDUAL_ID', how='inner')
#df = pd.merge(df, df_termination, on='INDIVIDUAL_ID', how='outer')
df.head()

,INDIVIDUAL_ID,ADDRESS_ID,CUST_ORIG_DATE,DATE_OF_BIRTH,SOCIAL_SECURITY_NUMBER,CUST_START_DATE,CURR_ANN_AMT_CAR,CURR_ANN_AMT_HEALTH,CURR_ANN_AMT_HOUSE,INCOME,HAS_CHILDREN,LENGTH_OF_RESIDENCE,MARITAL_STATUS,HOME_MARKET_VALUE,HOME_OWNER,COLLEGE_DEGREE,GOOD_CREDIT,ADVANCED_STUDIES
0,221300017872,521300005982,2018-12-09,1978-06-23,608-XX-7640,2018-12-09,1318.877997,517.999317,411,33750.0,2.0,15.0,Married,50000 - 74999,1,1,1,N
1,221300134410,521300051115,2018-01-02,1950-05-30,342-XX-6908,2018-01-02,1474.199182,558.417779,414,41250.0,0.0,2.0,Single,50000 - 74999,1,0,0,N
2,221300673028,521300247929,2009-09-23,1967-07-07,240-XX-9224,2009-09-23,1467.375112,701.649310,442,63750.0,0.0,10.0,Married,75000 - 99999,1,0,0,N
3,221301573419,521300570147,2022-07-25,1969-05-25,775-XX-6249,2022-07-25,1492.409561,401.517490,463,187500.0,2.0,6.0,Married,175000 - 199999,1,0,1,N
4,221301622347,521300588399,2006-10-11,1972-09-25,629-XX-7298,2006-10-11,1284.633494,772.857222,366,131250.0,1.0,4.0,Married,225000 - 249999,1,1,1,Y

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2133685 entries, 0 to 2133684
Data columns (total 18 columns):
 #   Column                  Dtype
---  ------                  -----
 0   INDIVIDUAL_ID           int64
 1   ADDRESS_ID              int64
 2   CUST_ORIG_DATE          object
 3   DATE_OF_BIRTH           object
 4   SOCIAL_SECURITY_NUMBER  object
 5   CUST_START_DATE         object
 6   CURR_ANN_AMT_CAR        float64
 7   CURR_ANN_AMT_HEALTH     float64
 8   CURR_ANN_AMT_HOUSE      int64
 9   INCOME                  float64
 10  HAS_CHILDREN            float64
 11  LENGTH_OF_RESIDENCE     float64
 12  MARITAL_STATUS          object
 13  HOME_MARKET_VALUE       object
 14  HOME_OWNER              int64
 15  COLLEGE_DEGREE          int64
 16  GOOD_CREDIT             int64
 17  ADVANCED_STUDIES        object
dtypes: float64(5), int64(6), object(7)
memory usage: 309.3+ MB

#### Data Quality Assessment Plan

We will now embark on a thorough data quality assessment based on the data quality framework. Our goal is to ensure that our dataset adheres to the following dimensions of data quality:

- **Completeness**: We will check for and address any missing values in our columns.
- **Consistency**: We will verify that all data is in the correct format and that the dataset conforms to logical constraints.
- **Correctness**: We will validate the accuracy of the data and correct any erroneous values.
- **Uniqueness**: We will ensure that each customer is represented uniquely without any duplicates.
- **Timeliness**: We will examine date columns to ensure the data is current and relevant for our analysis.
- **Stability**: We will assess whether the dataset includes any volatile data that could change frequently and affect analysis.
- **Relevance**: We will evaluate whether all included features are necessary for the analysis or if some may be redundant.
- **Contextualization**: We will make sure that the data is well-understood in terms of its collection context and meaning.
- **Trustworthiness**: We will discuss the source and collection process of the data to ensure its reliability.

#### Initial Observations from `info()`
- The `CUST_START_DATE`, `MARITAL_STATUS`, `HOME_MARKET_VALUE`, and `SUSPD_DATE` columns contain missing values that will need to be addressed.
- The date columns (`CUST_ORIG_DATE`, `DATE_OF_BIRTH`, `CUST_START_DATE`, `SUSPD_DATE`) are of `object` type and likely need to be converted to `datetime` for proper analysis.
- The `SOCIAL_SECURITY_NUMBER` should be examined to ensure it meets the correct format and privacy standards.
- The `HOME_MARKET_VALUE` is listed as an object type, which suggests it may contain non-numeric values or special characters that will require cleaning.

#### Next Steps
We will proceed with the data quality assessment by examining each column in detail, identifying data quality issues, and applying corrective measures. This will involve:
- Converting date columns to the appropriate `datetime` format.
- Handling missing values strategically, deciding on imputation or removal.
- Normalizing numerical columns like `HOME_MARKET_VALUE` to ensure they are in the correct format for analysis.
- Verifying the uniqueness of the `INDIVIDUAL_ID` to avoid duplicate records.